In [1]:
import pandas as pd
import pickle
import requests
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
%matplotlib inline
import os

In [91]:
def table_parser(page):
    file = open(page)
    # page = page.split('\n')
    table = []
    num = 0
    for line in file:
        if 'Grade' in line:
            num += 1
        if num > 0 and len(line.split())!=0:
            num += 1
        if 3 <= num < 21:
            # line = line.rstrip()
            if len(line.split())!=0:
                split_line = line.split(' ')
                split_line = [x for x in split_line if x != '']
                strip_line = split_line[:16]
                table.append(strip_line)
    df = pd.DataFrame(table)
    df.drop([0,1,2,3,4,6,7,8,9,11,12,13,14],axis=1,inplace=True)
    df.drop([15,16,17],inplace=True)
    df.columns = ['WG', 'WL', 'WS']
    df.index = range(1,16)
    
    file.close()
    return df

In [124]:
table_parser('docs/AK/007,007,AK,Ancorage/09Sep1997/AK-007,007,AK,Ancorage-09Sep1997.html')

       WG     WL     WS
1   14.78  16.26  22.34
2   15.94  17.53  23.50
3   17.10  18.82  24.66
4   18.26  20.08  25.82
5   19.42  21.36  26.98
6   20.57  22.64  28.13
7   21.73  23.90  29.29
8   22.89  25.18  30.45
9   24.05  26.45  31.61
10  25.21  27.73  32.77
11  26.36  29.00  33.29
12  27.53  30.28  33.96
13  28.68  31.55  34.80
14  29.84  32.82  35.80
15  31.00  34.10  36.95

In [78]:
test = pd.DataFrame(test_df)

In [121]:
dic = {}
for state in os.listdir('docs'):
    dic[state] = {}
    for county in os.listdir('docs/'+state):
        
        name = county.split(',')[3]
        dic[state][name] = {}
        for date in os.listdir('docs/'+state+'/'+county):
            try:
                dic[state][name][date] = table_parser('docs/{}/{}/{}/{}-{}-{}.html'.format(state, county, date,state, county, date))
            except ValueError:
                print(state, county, date)

AZ 009,009,RUS,Gila County 07May1996
AZ 009,009,RUS,Yavapai County 07May1996
AZ 010,010,RUS,Graham County 07May1996
AZ 010,010,RUS,Greenlee County 07May1996
NY 097,097,RUS,Madison County 01May1997
NY 097,097,RUS,Madison County 01May2001
NY 097,097,RUS,Madison County 12Apr2016
NY 097,097,RUS,Madison County 14Apr2015
NY 097,097,RUS,Madison County 15Apr2014
NY 097,097,RUS,Madison County 16Apr2013
NY 097,097,RUS,Madison County 17Apr2012
NY 097,097,RUS,Madison County 18Apr2000
NY 097,097,RUS,Madison County 19Apr2011
NY 097,097,RUS,Madison County 20Apr1999
NY 097,097,RUS,Madison County 20Apr2010
NY 097,097,RUS,Madison County 21Apr2009
NY 097,097,RUS,Madison County 22Apr2008
NY 097,097,RUS,Madison County 23Apr1998
NY 097,097,RUS,Madison County 24Apr2007
NY 097,097,RUS,Madison County 25Apr2006
NY 097,097,RUS,Madison County 26Apr1996
NY 097,097,RUS,Madison County 26Apr2005
NY 097,097,RUS,Madison County 27Apr2004
NY 097,097,RUS,Madison County 29Apr2003
NY 097,097,RUS,Madison County 30Apr2002

In [117]:
# dic = {'A': {'a': {1: [2,3,4,5,6],
#    ...:                           2: [2,3,4,5,6]},
#    ...:                     'b': {1: [2,3,4,5,6],
#    ...:                           2: [2,3,4,5,6]}},
#    ...:               'B': {'a': {1: [2,3,4,5,6],
#    ...:                           2: [2,3,4,5,6]},
#    ...:                     'b': {1: [2,3,4,5,6],
#    ...:                           2: [2,3,4,5,6]}}}

In [122]:
reform = {(level1_key, level2_key, level3_key): values
           for level1_key, level2_dict in dic.items()
           for level2_key, level3_dict in level2_dict.items()
           for level3_key, level4_dict in level3_dict.items()
           for level4_key, values      in level4_dict.items()}

In [123]:
pd.DataFrame(reform).T.head()

                          1      2      3      4      5      6      7      8   \
AK Ancorage 09Sep1997  22.34  23.50  24.66  25.82  26.98  28.13  29.29  30.45
            09Sep2008  25.59  27.47  29.37  31.26  33.18  35.05  36.95  38.85
            10Sep1996  22.22  23.35  24.48  25.60  26.73  27.87  29.00  30.12
            11Sep2007  24.84  26.67  28.51  30.35  32.21  34.03  35.87  37.72
            12Sep2006  24.39  26.19  28.00  29.81  31.63  33.42  35.23  37.04

                          9      10     11     12     13     14     15
AK Ancorage 09Sep1997  31.61  32.77  33.29  33.96  34.80  35.80  36.95
            09Sep2008  40.75  42.64  43.53  44.64  46.03  47.71  49.63
            10Sep1996  31.25  32.38  32.87  33.50  34.29  35.24  36.32
            11Sep2007  39.56  41.40  42.26  43.34  44.69  46.32  48.18
            12Sep2006  38.85  40.66  41.50  42.56  43.89  45.49  47.32